###################################################################

# Created by write_sdc for scenario [FUNC_WORST] on Fri Oct 28 17:19:01 2022

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
#set_operating_conditions -analysis_type on_chip_variation typical_1.00 -library lib224_b15_7t_108pp_base_hp_psss_0p765v_125c_tttt_ctyp_ccslnt
set_max_fanout 16 [current_design]
set_max_transition 200 [current_design]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports rst_ni]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {en_ifetch_i[3]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {en_ifetch_i[2]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {en_ifetch_i[1]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {en_ifetch_i[0]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[108]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[107]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[106]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[105]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[104]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[103]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[102]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[101]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[100]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[99]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[98]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[97]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[96]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[95]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[94]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[93]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[92]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[91]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[90]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[89]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[88]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[87]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[86]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[85]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[84]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[83]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[82]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[81]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[80]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[79]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[78]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[77]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[76]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[75]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[74]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[73]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[72]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[71]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[70]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[69]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[68]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[67]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[66]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[65]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[64]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[63]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[62]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[61]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[60]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[59]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[58]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[57]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[56]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[55]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[54]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[53]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[52]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[51]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[50]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[49]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[48]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[47]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[46]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[45]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[44]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[43]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[42]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[41]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[40]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[39]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[38]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[37]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[36]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[35]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[34]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[33]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[32]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[31]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[30]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[29]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[28]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[27]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[26]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[25]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[24]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[23]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[22]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[21]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[20]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[19]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[18]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[17]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[16]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[15]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[14]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[13]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[12]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[11]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[10]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[9]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[8]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[7]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[6]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[5]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[4]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[3]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[2]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[1]}]
set_driving_cell -lib_cell b15bfn000ah1n12x5 -input_transition_rise 100 -input_transition_fall 100 [get_ports {tl_i[0]}]
set_load -pin_load 5.078 [get_ports {tl_o[65]}]
set_load -pin_load 5.078 [get_ports {tl_o[64]}]
set_load -pin_load 5.078 [get_ports {tl_o[63]}]
set_load -pin_load 5.078 [get_ports {tl_o[62]}]
set_load -pin_load 5.078 [get_ports {tl_o[61]}]
set_load -pin_load 5.078 [get_ports {tl_o[60]}]
set_load -pin_load 5.078 [get_ports {tl_o[59]}]
set_load -pin_load 5.078 [get_ports {tl_o[58]}]
set_load -pin_load 5.078 [get_ports {tl_o[57]}]
set_load -pin_load 5.078 [get_ports {tl_o[56]}]
set_load -pin_load 5.078 [get_ports {tl_o[55]}]
set_load -pin_load 5.078 [get_ports {tl_o[54]}]
set_load -pin_load 5.078 [get_ports {tl_o[53]}]
set_load -pin_load 5.078 [get_ports {tl_o[52]}]
set_load -pin_load 5.078 [get_ports {tl_o[51]}]
set_load -pin_load 5.078 [get_ports {tl_o[50]}]
set_load -pin_load 5.078 [get_ports {tl_o[49]}]
set_load -pin_load 5.078 [get_ports {tl_o[48]}]
set_load -pin_load 5.078 [get_ports {tl_o[47]}]
set_load -pin_load 5.078 [get_ports {tl_o[46]}]
set_load -pin_load 5.078 [get_ports {tl_o[45]}]
set_load -pin_load 5.078 [get_ports {tl_o[44]}]
set_load -pin_load 5.078 [get_ports {tl_o[43]}]
set_load -pin_load 5.078 [get_ports {tl_o[42]}]
set_load -pin_load 5.078 [get_ports {tl_o[41]}]
set_load -pin_load 5.078 [get_ports {tl_o[40]}]
set_load -pin_load 5.078 [get_ports {tl_o[39]}]
set_load -pin_load 5.078 [get_ports {tl_o[38]}]
set_load -pin_load 5.078 [get_ports {tl_o[37]}]
set_load -pin_load 5.078 [get_ports {tl_o[36]}]
set_load -pin_load 5.078 [get_ports {tl_o[35]}]
set_load -pin_load 5.078 [get_ports {tl_o[34]}]
set_load -pin_load 5.078 [get_ports {tl_o[33]}]
set_load -pin_load 5.078 [get_ports {tl_o[32]}]
set_load -pin_load 5.078 [get_ports {tl_o[31]}]
set_load -pin_load 5.078 [get_ports {tl_o[30]}]
set_load -pin_load 5.078 [get_ports {tl_o[29]}]
set_load -pin_load 5.078 [get_ports {tl_o[28]}]
set_load -pin_load 5.078 [get_ports {tl_o[27]}]
set_load -pin_load 5.078 [get_ports {tl_o[26]}]
set_load -pin_load 5.078 [get_ports {tl_o[25]}]
set_load -pin_load 5.078 [get_ports {tl_o[24]}]
set_load -pin_load 5.078 [get_ports {tl_o[23]}]
set_load -pin_load 5.078 [get_ports {tl_o[22]}]
set_load -pin_load 5.078 [get_ports {tl_o[21]}]
set_load -pin_load 5.078 [get_ports {tl_o[20]}]
set_load -pin_load 5.078 [get_ports {tl_o[19]}]
set_load -pin_load 5.078 [get_ports {tl_o[18]}]
set_load -pin_load 5.078 [get_ports {tl_o[17]}]
set_load -pin_load 5.078 [get_ports {tl_o[16]}]
set_load -pin_load 5.078 [get_ports {tl_o[15]}]
set_load -pin_load 5.078 [get_ports {tl_o[14]}]
set_load -pin_load 5.078 [get_ports {tl_o[13]}]
set_load -pin_load 5.078 [get_ports {tl_o[12]}]
set_load -pin_load 5.078 [get_ports {tl_o[11]}]
set_load -pin_load 5.078 [get_ports {tl_o[10]}]
set_load -pin_load 5.078 [get_ports {tl_o[9]}]
set_load -pin_load 5.078 [get_ports {tl_o[8]}]
set_load -pin_load 5.078 [get_ports {tl_o[7]}]
set_load -pin_load 5.078 [get_ports {tl_o[6]}]
set_load -pin_load 5.078 [get_ports {tl_o[5]}]
set_load -pin_load 5.078 [get_ports {tl_o[4]}]
set_load -pin_load 5.078 [get_ports {tl_o[3]}]
set_load -pin_load 5.078 [get_ports {tl_o[2]}]
set_load -pin_load 5.078 [get_ports {tl_o[1]}]
set_load -pin_load 5.078 [get_ports {tl_o[0]}]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__5_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__4_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__2_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__3_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__15__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__16_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__13__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__14_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__11__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__12_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__9__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__10_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__31__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__32_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__8__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__9_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__27__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__28_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__16__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__17_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__10__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__11_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__24__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__25_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__12__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__13_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__33__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__34_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__35__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__36_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__14__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__15_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__18__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__19_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__22__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__23_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__37__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__38_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__29__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__30_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__20__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__21_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__7_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__3_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__5_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__3_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__7_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_]
#set_max_time_borrow 0 [get_cells rvalid_reg_u_tlul_adapter_sram_intg_error_q_reg]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_under_rst_reg]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_under_rst_reg]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_under_rst_reg]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__39_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__26_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__8_]
#set_max_time_borrow 0 [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__0_]
#set_max_time_borrow 0 [get_cells u_sram]
create_clock [get_ports clk_i]  -period 10000  -waveform {0 5000}
set_clock_latency 500  [get_clocks clk_i]
set_clock_uncertainty -setup 250  [get_clocks clk_i]
set_clock_uncertainty -hold 150  [get_clocks clk_i]
set_clock_transition -max -rise 200 [get_clocks clk_i]
set_clock_transition -max -fall 200 [get_clocks clk_i]
set_clock_transition -min -rise 200 [get_clocks clk_i]
set_clock_transition -min -fall 200 [get_clocks clk_i]
create_clock -name virtual_clk  -period 10000  -waveform {0 5000}
set_clock_latency 500  [get_clocks virtual_clk]
set_clock_uncertainty -setup 250  [get_clocks virtual_clk]
set_clock_uncertainty -hold 150  [get_clocks virtual_clk]
group_path -weight 5  -name REG2REG  -from [list [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__5_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__7_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__8__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__9_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__10__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__11_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__12__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__13_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__14__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__15_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__16__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__17_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__18__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__19_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__20__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__21_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__22__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__23_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__24__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__25_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__26_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__27__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__28_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__29__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__30_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__31__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__32_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__33__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__34_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__35__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__36_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__37__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__38_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__39_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_under_rst_reg] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__0_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__2_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__4_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_under_rst_reg] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__5_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__7_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__8_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__9__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__10_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__11__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__12_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__13__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__14_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__15__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__16_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_under_rst_reg] [get_cells u_sram] [get_cells rvalid_reg_u_tlul_adapter_sram_intg_error_q_reg]]  -to [list [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__5_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__7_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__8__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__9_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__10__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__11_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__12__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__13_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__14__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__15_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__16__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__17_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__18__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__19_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__20__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__21_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__22__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__23_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__24__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__25_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__26_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__27__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__28_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__29__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__30_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__31__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__32_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__33__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__34_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__35__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__36_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__37__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__38_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_reg_0__39_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_under_rst_reg] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__0_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__2_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_reg_0__4_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_under_rst_reg] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__2__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__3_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__4__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__5_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__6__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__7_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__8_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__9__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__10_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__11__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__12_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__13__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__14_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__15__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_reg_0__16_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_0__u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_0_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_rptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_wptr_o_reg_1_] [get_cells u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_under_rst_reg] [get_cells u_sram] [get_cells rvalid_reg_u_tlul_adapter_sram_intg_error_q_reg]]
group_path -name COMB  -from [list [get_ports clk_i] [get_ports rst_ni] [get_ports {en_ifetch_i[3]}] [get_ports {en_ifetch_i[2]}] [get_ports {en_ifetch_i[1]}] [get_ports {en_ifetch_i[0]}] [get_ports {tl_i[108]}] [get_ports {tl_i[107]}] [get_ports {tl_i[106]}] [get_ports {tl_i[105]}] [get_ports {tl_i[104]}] [get_ports {tl_i[103]}] [get_ports {tl_i[102]}] [get_ports {tl_i[101]}] [get_ports {tl_i[100]}] [get_ports {tl_i[99]}] [get_ports {tl_i[98]}] [get_ports {tl_i[97]}] [get_ports {tl_i[96]}] [get_ports {tl_i[95]}] [get_ports {tl_i[94]}] [get_ports {tl_i[93]}] [get_ports {tl_i[92]}] [get_ports {tl_i[91]}] [get_ports {tl_i[90]}] [get_ports {tl_i[89]}] [get_ports {tl_i[88]}] [get_ports {tl_i[87]}] [get_ports {tl_i[86]}] [get_ports {tl_i[85]}] [get_ports {tl_i[84]}] [get_ports {tl_i[83]}] [get_ports {tl_i[82]}] [get_ports {tl_i[81]}] [get_ports {tl_i[80]}] [get_ports {tl_i[79]}] [get_ports {tl_i[78]}] [get_ports {tl_i[77]}] [get_ports {tl_i[76]}] [get_ports {tl_i[75]}] [get_ports {tl_i[74]}] [get_ports {tl_i[73]}] [get_ports {tl_i[72]}] [get_ports {tl_i[71]}] [get_ports {tl_i[70]}] [get_ports {tl_i[69]}] [get_ports {tl_i[68]}] [get_ports {tl_i[67]}] [get_ports {tl_i[66]}] [get_ports {tl_i[65]}] [get_ports {tl_i[64]}] [get_ports {tl_i[63]}] [get_ports {tl_i[62]}] [get_ports {tl_i[61]}] [get_ports {tl_i[60]}] [get_ports {tl_i[59]}] [get_ports {tl_i[58]}] [get_ports {tl_i[57]}] [get_ports {tl_i[56]}] [get_ports {tl_i[55]}] [get_ports {tl_i[54]}] [get_ports {tl_i[53]}] [get_ports {tl_i[52]}] [get_ports {tl_i[51]}] [get_ports {tl_i[50]}] [get_ports {tl_i[49]}] [get_ports {tl_i[48]}] [get_ports {tl_i[47]}] [get_ports {tl_i[46]}] [get_ports {tl_i[45]}] [get_ports {tl_i[44]}] [get_ports {tl_i[43]}] [get_ports {tl_i[42]}] [get_ports {tl_i[41]}] [get_ports {tl_i[40]}] [get_ports {tl_i[39]}] [get_ports {tl_i[38]}] [get_ports {tl_i[37]}] [get_ports {tl_i[36]}] [get_ports {tl_i[35]}] [get_ports {tl_i[34]}] [get_ports {tl_i[33]}] [get_ports {tl_i[32]}] [get_ports {tl_i[31]}] [get_ports {tl_i[30]}] [get_ports {tl_i[29]}] [get_ports {tl_i[28]}] [get_ports {tl_i[27]}] [get_ports {tl_i[26]}] [get_ports {tl_i[25]}] [get_ports {tl_i[24]}] [get_ports {tl_i[23]}] [get_ports {tl_i[22]}] [get_ports {tl_i[21]}] [get_ports {tl_i[20]}] [get_ports {tl_i[19]}] [get_ports {tl_i[18]}] [get_ports {tl_i[17]}] [get_ports {tl_i[16]}] [get_ports {tl_i[15]}] [get_ports {tl_i[14]}] [get_ports {tl_i[13]}] [get_ports {tl_i[12]}] [get_ports {tl_i[11]}] [get_ports {tl_i[10]}] [get_ports {tl_i[9]}] [get_ports {tl_i[8]}] [get_ports {tl_i[7]}] [get_ports {tl_i[6]}] [get_ports {tl_i[5]}] [get_ports {tl_i[4]}] [get_ports {tl_i[3]}] [get_ports {tl_i[2]}] [get_ports {tl_i[1]}] [get_ports {tl_i[0]}]]  -to [list [get_ports {tl_o[65]}] [get_ports {tl_o[64]}] [get_ports {tl_o[63]}] [get_ports {tl_o[62]}] [get_ports {tl_o[61]}] [get_ports {tl_o[60]}] [get_ports {tl_o[59]}] [get_ports {tl_o[58]}] [get_ports {tl_o[57]}] [get_ports {tl_o[56]}] [get_ports {tl_o[55]}] [get_ports {tl_o[54]}] [get_ports {tl_o[53]}] [get_ports {tl_o[52]}] [get_ports {tl_o[51]}] [get_ports {tl_o[50]}] [get_ports {tl_o[49]}] [get_ports {tl_o[48]}] [get_ports {tl_o[47]}] [get_ports {tl_o[46]}] [get_ports {tl_o[45]}] [get_ports {tl_o[44]}] [get_ports {tl_o[43]}] [get_ports {tl_o[42]}] [get_ports {tl_o[41]}] [get_ports {tl_o[40]}] [get_ports {tl_o[39]}] [get_ports {tl_o[38]}] [get_ports {tl_o[37]}] [get_ports {tl_o[36]}] [get_ports {tl_o[35]}] [get_ports {tl_o[34]}] [get_ports {tl_o[33]}] [get_ports {tl_o[32]}] [get_ports {tl_o[31]}] [get_ports {tl_o[30]}] [get_ports {tl_o[29]}] [get_ports {tl_o[28]}] [get_ports {tl_o[27]}] [get_ports {tl_o[26]}] [get_ports {tl_o[25]}] [get_ports {tl_o[24]}] [get_ports {tl_o[23]}] [get_ports {tl_o[22]}] [get_ports {tl_o[21]}] [get_ports {tl_o[20]}] [get_ports {tl_o[19]}] [get_ports {tl_o[18]}] [get_ports {tl_o[17]}] [get_ports {tl_o[16]}] [get_ports {tl_o[15]}] [get_ports {tl_o[14]}] [get_ports {tl_o[13]}] [get_ports {tl_o[12]}] [get_ports {tl_o[11]}] [get_ports {tl_o[10]}] [get_ports {tl_o[9]}] [get_ports {tl_o[8]}] [get_ports {tl_o[7]}] [get_ports {tl_o[6]}] [get_ports {tl_o[5]}] [get_ports {tl_o[4]}] [get_ports {tl_o[3]}] [get_ports {tl_o[2]}] [get_ports {tl_o[1]}] [get_ports {tl_o[0]}]]
group_path -name INPUTS  -from [list [get_ports rst_ni] [get_ports {en_ifetch_i[3]}] [get_ports {en_ifetch_i[2]}] [get_ports {en_ifetch_i[1]}] [get_ports {en_ifetch_i[0]}] [get_ports {tl_i[108]}] [get_ports {tl_i[107]}] [get_ports {tl_i[106]}] [get_ports {tl_i[105]}] [get_ports {tl_i[104]}] [get_ports {tl_i[103]}] [get_ports {tl_i[102]}] [get_ports {tl_i[101]}] [get_ports {tl_i[100]}] [get_ports {tl_i[99]}] [get_ports {tl_i[98]}] [get_ports {tl_i[97]}] [get_ports {tl_i[96]}] [get_ports {tl_i[95]}] [get_ports {tl_i[94]}] [get_ports {tl_i[93]}] [get_ports {tl_i[92]}] [get_ports {tl_i[91]}] [get_ports {tl_i[90]}] [get_ports {tl_i[89]}] [get_ports {tl_i[88]}] [get_ports {tl_i[87]}] [get_ports {tl_i[86]}] [get_ports {tl_i[85]}] [get_ports {tl_i[84]}] [get_ports {tl_i[83]}] [get_ports {tl_i[82]}] [get_ports {tl_i[81]}] [get_ports {tl_i[80]}] [get_ports {tl_i[79]}] [get_ports {tl_i[78]}] [get_ports {tl_i[77]}] [get_ports {tl_i[76]}] [get_ports {tl_i[75]}] [get_ports {tl_i[74]}] [get_ports {tl_i[73]}] [get_ports {tl_i[72]}] [get_ports {tl_i[71]}] [get_ports {tl_i[70]}] [get_ports {tl_i[69]}] [get_ports {tl_i[68]}] [get_ports {tl_i[67]}] [get_ports {tl_i[66]}] [get_ports {tl_i[65]}] [get_ports {tl_i[64]}] [get_ports {tl_i[63]}] [get_ports {tl_i[62]}] [get_ports {tl_i[61]}] [get_ports {tl_i[60]}] [get_ports {tl_i[59]}] [get_ports {tl_i[58]}] [get_ports {tl_i[57]}] [get_ports {tl_i[56]}] [get_ports {tl_i[55]}] [get_ports {tl_i[54]}] [get_ports {tl_i[53]}] [get_ports {tl_i[52]}] [get_ports {tl_i[51]}] [get_ports {tl_i[50]}] [get_ports {tl_i[49]}] [get_ports {tl_i[48]}] [get_ports {tl_i[47]}] [get_ports {tl_i[46]}] [get_ports {tl_i[45]}] [get_ports {tl_i[44]}] [get_ports {tl_i[43]}] [get_ports {tl_i[42]}] [get_ports {tl_i[41]}] [get_ports {tl_i[40]}] [get_ports {tl_i[39]}] [get_ports {tl_i[38]}] [get_ports {tl_i[37]}] [get_ports {tl_i[36]}] [get_ports {tl_i[35]}] [get_ports {tl_i[34]}] [get_ports {tl_i[33]}] [get_ports {tl_i[32]}] [get_ports {tl_i[31]}] [get_ports {tl_i[30]}] [get_ports {tl_i[29]}] [get_ports {tl_i[28]}] [get_ports {tl_i[27]}] [get_ports {tl_i[26]}] [get_ports {tl_i[25]}] [get_ports {tl_i[24]}] [get_ports {tl_i[23]}] [get_ports {tl_i[22]}] [get_ports {tl_i[21]}] [get_ports {tl_i[20]}] [get_ports {tl_i[19]}] [get_ports {tl_i[18]}] [get_ports {tl_i[17]}] [get_ports {tl_i[16]}] [get_ports {tl_i[15]}] [get_ports {tl_i[14]}] [get_ports {tl_i[13]}] [get_ports {tl_i[12]}] [get_ports {tl_i[11]}] [get_ports {tl_i[10]}] [get_ports {tl_i[9]}] [get_ports {tl_i[8]}] [get_ports {tl_i[7]}] [get_ports {tl_i[6]}] [get_ports {tl_i[5]}] [get_ports {tl_i[4]}] [get_ports {tl_i[3]}] [get_ports {tl_i[2]}] [get_ports {tl_i[1]}] [get_ports {tl_i[0]}]]
group_path -name OUTPUTS  -to [list [get_ports {tl_o[65]}] [get_ports {tl_o[64]}] [get_ports {tl_o[63]}] [get_ports {tl_o[62]}] [get_ports {tl_o[61]}] [get_ports {tl_o[60]}] [get_ports {tl_o[59]}] [get_ports {tl_o[58]}] [get_ports {tl_o[57]}] [get_ports {tl_o[56]}] [get_ports {tl_o[55]}] [get_ports {tl_o[54]}] [get_ports {tl_o[53]}] [get_ports {tl_o[52]}] [get_ports {tl_o[51]}] [get_ports {tl_o[50]}] [get_ports {tl_o[49]}] [get_ports {tl_o[48]}] [get_ports {tl_o[47]}] [get_ports {tl_o[46]}] [get_ports {tl_o[45]}] [get_ports {tl_o[44]}] [get_ports {tl_o[43]}] [get_ports {tl_o[42]}] [get_ports {tl_o[41]}] [get_ports {tl_o[40]}] [get_ports {tl_o[39]}] [get_ports {tl_o[38]}] [get_ports {tl_o[37]}] [get_ports {tl_o[36]}] [get_ports {tl_o[35]}] [get_ports {tl_o[34]}] [get_ports {tl_o[33]}] [get_ports {tl_o[32]}] [get_ports {tl_o[31]}] [get_ports {tl_o[30]}] [get_ports {tl_o[29]}] [get_ports {tl_o[28]}] [get_ports {tl_o[27]}] [get_ports {tl_o[26]}] [get_ports {tl_o[25]}] [get_ports {tl_o[24]}] [get_ports {tl_o[23]}] [get_ports {tl_o[22]}] [get_ports {tl_o[21]}] [get_ports {tl_o[20]}] [get_ports {tl_o[19]}] [get_ports {tl_o[18]}] [get_ports {tl_o[17]}] [get_ports {tl_o[16]}] [get_ports {tl_o[15]}] [get_ports {tl_o[14]}] [get_ports {tl_o[13]}] [get_ports {tl_o[12]}] [get_ports {tl_o[11]}] [get_ports {tl_o[10]}] [get_ports {tl_o[9]}] [get_ports {tl_o[8]}] [get_ports {tl_o[7]}] [get_ports {tl_o[6]}] [get_ports {tl_o[5]}] [get_ports {tl_o[4]}] [get_ports {tl_o[3]}] [get_ports {tl_o[2]}] [get_ports {tl_o[1]}] [get_ports {tl_o[0]}]]
set_input_delay -clock virtual_clk  -max 100  [get_ports rst_ni]
set_input_delay -clock virtual_clk  -min 50  [get_ports rst_ni]
set_input_delay -clock virtual_clk  -max 100  [get_ports {en_ifetch_i[3]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {en_ifetch_i[3]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {en_ifetch_i[2]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {en_ifetch_i[2]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {en_ifetch_i[1]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {en_ifetch_i[1]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {en_ifetch_i[0]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {en_ifetch_i[0]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[108]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[108]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[107]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[107]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[106]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[106]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[105]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[105]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[104]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[104]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[103]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[103]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[102]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[102]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[101]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[101]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[100]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[100]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[99]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[99]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[98]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[98]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[97]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[97]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[96]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[96]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[95]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[95]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[94]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[94]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[93]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[93]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[92]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[92]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[91]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[91]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[90]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[90]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[89]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[89]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[88]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[88]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[87]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[87]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[86]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[86]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[85]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[85]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[84]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[84]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[83]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[83]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[82]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[82]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[81]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[81]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[80]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[80]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[79]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[79]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[78]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[78]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[77]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[77]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[76]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[76]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[75]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[75]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[74]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[74]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[73]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[73]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[72]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[72]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[71]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[71]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[70]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[70]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[69]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[69]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[68]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[68]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[67]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[67]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[66]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[66]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[65]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[65]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[64]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[64]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[63]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[63]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[62]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[62]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[61]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[61]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[60]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[60]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[59]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[59]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[58]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[58]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[57]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[57]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[56]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[56]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[55]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[55]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[54]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[54]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[53]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[53]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[52]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[52]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[51]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[51]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[50]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[50]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[49]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[49]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[48]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[48]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[47]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[47]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[46]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[46]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[45]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[45]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[44]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[44]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[43]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[43]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[42]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[42]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[41]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[41]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[40]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[40]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[39]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[39]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[38]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[38]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[37]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[37]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[36]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[36]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[35]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[35]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[34]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[34]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[33]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[33]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[32]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[32]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[31]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[31]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[30]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[30]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[29]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[29]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[28]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[28]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[27]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[27]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[26]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[26]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[25]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[25]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[24]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[24]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[23]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[23]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[22]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[22]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[21]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[21]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[20]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[20]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[19]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[19]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[18]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[18]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[17]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[17]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[16]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[16]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[15]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[15]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[14]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[14]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[13]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[13]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[12]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[12]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[11]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[11]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[10]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[10]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[9]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[9]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[8]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[8]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[7]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[7]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[6]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[6]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[5]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[5]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[4]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[4]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[3]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[3]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[2]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[2]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[1]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[1]}]
set_input_delay -clock virtual_clk  -max 100  [get_ports {tl_i[0]}]
set_input_delay -clock virtual_clk  -min 50  [get_ports {tl_i[0]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[65]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[65]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[64]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[64]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[63]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[63]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[62]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[62]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[61]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[61]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[60]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[60]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[59]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[59]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[58]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[58]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[57]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[57]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[56]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[56]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[55]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[55]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[54]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[54]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[53]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[53]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[52]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[52]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[51]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[51]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[50]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[50]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[49]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[49]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[48]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[48]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[47]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[47]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[46]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[46]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[45]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[45]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[44]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[44]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[43]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[43]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[42]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[42]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[41]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[41]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[40]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[40]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[39]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[39]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[38]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[38]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[37]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[37]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[36]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[36]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[35]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[35]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[34]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[34]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[33]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[33]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[32]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[32]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[31]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[31]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[30]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[30]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[29]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[29]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[28]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[28]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[27]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[27]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[26]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[26]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[25]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[25]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[24]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[24]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[23]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[23]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[22]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[22]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[21]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[21]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[20]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[20]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[19]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[19]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[18]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[18]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[17]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[17]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[16]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[16]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[15]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[15]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[14]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[14]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[13]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[13]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[12]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[12]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[11]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[11]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[10]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[10]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[9]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[9]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[8]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[8]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[7]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[7]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[6]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[6]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[5]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[5]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[4]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[4]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[3]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[3]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[2]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[2]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[1]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[1]}]
set_output_delay -clock virtual_clk  -max 100  [get_ports {tl_o[0]}]
set_output_delay -clock virtual_clk  -min 50  [get_ports {tl_o[0]}]
#set_load 2.28115  [get_nets rst_ni]
#set_resistance 0.202052  [get_nets rst_ni]
#set_load 0.114427  [get_nets {en_ifetch_i[3]}]
#set_resistance 0.0172852  [get_nets {en_ifetch_i[3]}]
#set_load 0.169512  [get_nets {en_ifetch_i[2]}]
#set_resistance 0.0249512  [get_nets {en_ifetch_i[2]}]
#set_load 0.160744  [get_nets {en_ifetch_i[1]}]
#set_resistance 0.0236367  [get_nets {en_ifetch_i[1]}]
#set_load 0.105172  [get_nets {en_ifetch_i[0]}]
#set_resistance 0.0158624  [get_nets {en_ifetch_i[0]}]
#set_load 0.610904  [get_nets {tl_i[61]}]
#set_resistance 0.0821003  [get_nets {tl_i[61]}]
#set_load 1.01018  [get_nets {tl_i[60]}]
#set_resistance 0.114102  [get_nets {tl_i[60]}]
#set_load 0.272947  [get_nets {tl_o[65]}]
#set_resistance 0.0402528  [get_nets {tl_o[65]}]
#set_load 0.366995  [get_nets {tl_o[62]}]
#set_resistance 0.0540957  [get_nets {tl_o[62]}]
#set_load 0.104064  [get_nets {tl_o[58]}]
#set_resistance 0.0157098  [get_nets {tl_o[58]}]
#set_load 0.703432  [get_nets {tl_o[57]}]
#set_resistance 0.10013  [get_nets {tl_o[57]}]
#set_load 0.100588  [get_nets {tl_o[56]}]
#set_resistance 0.0151396  [get_nets {tl_o[56]}]
#set_load 0.240763  [get_nets {tl_o[55]}]
#set_resistance 0.0349691  [get_nets {tl_o[55]}]
#set_load 0.156424  [get_nets {tl_o[54]}]
#set_resistance 0.0232144  [get_nets {tl_o[54]}]
#set_load 0.244895  [get_nets {tl_o[53]}]
#set_resistance 0.0356133  [get_nets {tl_o[53]}]
#set_load 0.144565  [get_nets {tl_o[52]}]
#set_resistance 0.0214139  [get_nets {tl_o[52]}]
#set_load 0.156685  [get_nets {tl_o[51]}]
#set_resistance 0.0231396  [get_nets {tl_o[51]}]
#set_load 0.112643  [get_nets {tl_o[50]}]
#set_resistance 0.01673  [get_nets {tl_o[50]}]
#set_load 0.301784  [get_nets {tl_o[49]}]
#set_resistance 0.0436176  [get_nets {tl_o[49]}]
#set_load 0.285799  [get_nets {tl_o[47]}]
#set_resistance 0.0404042  [get_nets {tl_o[47]}]
#set_load 0.0761753  [get_nets {tl_o[46]}]
#set_resistance 0.0112002  [get_nets {tl_o[46]}]
#set_load 0.203115  [get_nets {tl_o[45]}]
#set_resistance 0.0294212  [get_nets {tl_o[45]}]
#set_load 0.238261  [get_nets {tl_o[44]}]
#set_resistance 0.0352314  [get_nets {tl_o[44]}]
#set_load 0.302006  [get_nets {tl_o[43]}]
#set_resistance 0.0432256  [get_nets {tl_o[43]}]
#set_load 0.0561396  [get_nets {tl_o[42]}]
#set_resistance 0.0083112  [get_nets {tl_o[42]}]
#set_load 0.14641  [get_nets {tl_o[41]}]
#set_resistance 0.0208253  [get_nets {tl_o[41]}]
#set_load 0.201511  [get_nets {tl_o[40]}]
#set_resistance 0.0287731  [get_nets {tl_o[40]}]
#set_load 0.966436  [get_nets {tl_o[39]}]
#set_resistance 0.142623  [get_nets {tl_o[39]}]
#set_load 0.0996296  [get_nets {tl_o[38]}]
#set_resistance 0.0141135  [get_nets {tl_o[38]}]
#set_load 0.230814  [get_nets {tl_o[37]}]
#set_resistance 0.0325979  [get_nets {tl_o[37]}]
#set_load 0.662147  [get_nets {tl_o[36]}]
#set_resistance 0.0992734  [get_nets {tl_o[36]}]
#set_load 1.14001  [get_nets {tl_o[35]}]
#set_resistance 0.167238  [get_nets {tl_o[35]}]
#set_load 0.132093  [get_nets {tl_o[34]}]
#set_resistance 0.0189  [get_nets {tl_o[34]}]
#set_load 0.119494  [get_nets {tl_o[33]}]
#set_resistance 0.0171248  [get_nets {tl_o[33]}]
#set_load 0.105562  [get_nets {tl_o[32]}]
#set_resistance 0.0158176  [get_nets {tl_o[32]}]
#set_load 0.276876  [get_nets {tl_o[31]}]
#set_resistance 0.0393  [get_nets {tl_o[31]}]
#set_load 0.0298269  [get_nets {tl_o[30]}]
#set_resistance 0.0044907  [get_nets {tl_o[30]}]
#set_load 0.179873  [get_nets {tl_o[29]}]
#set_resistance 0.0265149  [get_nets {tl_o[29]}]
#set_load 0.128128  [get_nets {tl_o[28]}]
#set_resistance 0.0185208  [get_nets {tl_o[28]}]
#set_load 0.214024  [get_nets {tl_o[27]}]
#set_resistance 0.0307414  [get_nets {tl_o[27]}]
#set_load 0.0512304  [get_nets {tl_o[26]}]
#set_resistance 0.00777431  [get_nets {tl_o[26]}]
#set_load 0.150277  [get_nets {tl_o[25]}]
#set_resistance 0.0214622  [get_nets {tl_o[25]}]
#set_load 0.0751347  [get_nets {tl_o[24]}]
#set_resistance 0.0112357  [get_nets {tl_o[24]}]
#set_load 0.0889264  [get_nets {tl_o[23]}]
#set_resistance 0.0128179  [get_nets {tl_o[23]}]
#set_load 0.0984307  [get_nets {tl_o[22]}]
#set_resistance 0.0143417  [get_nets {tl_o[22]}]
#set_load 0.0778426  [get_nets {tl_o[21]}]
#set_resistance 0.0112561  [get_nets {tl_o[21]}]
#set_load 0.197998  [get_nets {tl_o[20]}]
#set_resistance 0.0282085  [get_nets {tl_o[20]}]
#set_load 0.198405  [get_nets {tl_o[19]}]
#set_resistance 0.0285627  [get_nets {tl_o[19]}]
#set_load 0.114904  [get_nets {tl_o[18]}]
#set_resistance 0.0164781  [get_nets {tl_o[18]}]
#set_load 0.117002  [get_nets {tl_o[17]}]
#set_resistance 0.0171172  [get_nets {tl_o[17]}]
#set_load 0.228644  [get_nets {tl_o[16]}]
#set_resistance 0.0325041  [get_nets {tl_o[16]}]
#set_load 0.528475  [get_nets {tl_o[8]}]
#set_resistance 0.0747206  [get_nets {tl_o[8]}]
#set_load 0.438874  [get_nets {tl_o[7]}]
#set_resistance 0.0621749  [get_nets {tl_o[7]}]
#set_load 0.638743  [get_nets {tl_o[6]}]
#set_resistance 0.0914202  [get_nets {tl_o[6]}]
#set_load 0.699881  [get_nets {tl_o[5]}]
#set_resistance 0.101073  [get_nets {tl_o[5]}]
#set_load 0.72647  [get_nets {tl_o[4]}]
#set_resistance 0.1051  [get_nets {tl_o[4]}]
#set_load 0.611234  [get_nets {tl_o[3]}]
#set_resistance 0.0885848  [get_nets {tl_o[3]}]
#set_load 0.666952  [get_nets {tl_o[2]}]
#set_resistance 0.0963598  [get_nets {tl_o[2]}]
#set_load 0.446313  [get_nets {tl_o[1]}]
#set_resistance 0.0661636  [get_nets {tl_o[1]}]
#set_load 0.302698  [get_nets {tl_o[0]}]
#set_resistance 0.0445436  [get_nets {tl_o[0]}]
#set_load 0.0748713  [get_nets rvalid]
#set_resistance 0.011111  [get_nets rvalid]
#set_load 1.26475  [get_nets wen]
#set_resistance 0.150127  [get_nets wen]
#set_load 1.0533  [get_nets N1]
#set_resistance 0.149879  [get_nets N1]
#set_load 0.524068  [get_nets n_0_net_]
#set_resistance 0.0720402  [get_nets n_0_net_]
#set_load 0.40739  [get_nets {addr[10]}]
#set_resistance 0.061354  [get_nets {addr[10]}]
#set_load 0.316099  [get_nets {addr[9]}]
#set_resistance 0.046775  [get_nets {addr[9]}]
#set_load 0.39186  [get_nets {addr[8]}]
#set_resistance 0.0574097  [get_nets {addr[8]}]
#set_load 0.219429  [get_nets {addr[7]}]
#set_resistance 0.0328299  [get_nets {addr[7]}]
#set_load 0.249175  [get_nets {addr[6]}]
#set_resistance 0.0374434  [get_nets {addr[6]}]
#set_load 0.339639  [get_nets {addr[5]}]
#set_resistance 0.0501405  [get_nets {addr[5]}]
#set_load 0.305283  [get_nets {addr[4]}]
#set_resistance 0.0460478  [get_nets {addr[4]}]
#set_load 0.364074  [get_nets {addr[3]}]
#set_resistance 0.0539978  [get_nets {addr[3]}]
#set_load 0.36436  [get_nets {addr[2]}]
#set_resistance 0.0544629  [get_nets {addr[2]}]
#set_load 0.26668  [get_nets {addr[1]}]
#set_resistance 0.0398201  [get_nets {addr[1]}]
#set_load 0.333603  [get_nets {addr[0]}]
#set_resistance 0.0503016  [get_nets {addr[0]}]
#set_load 0.274619  [get_nets {wdata[31]}]
#set_resistance 0.0407312  [get_nets {wdata[31]}]
#set_load 0.188029  [get_nets {wdata[30]}]
#set_resistance 0.0280257  [get_nets {wdata[30]}]
#set_load 0.260543  [get_nets {wdata[29]}]
#set_resistance 0.0384786  [get_nets {wdata[29]}]
#set_load 0.223002  [get_nets {wdata[28]}]
#set_resistance 0.0335005  [get_nets {wdata[28]}]
#set_load 0.348044  [get_nets {wdata[27]}]
#set_resistance 0.0523566  [get_nets {wdata[27]}]
#set_load 0.326752  [get_nets {wdata[26]}]
#set_resistance 0.0480469  [get_nets {wdata[26]}]
#set_load 0.370496  [get_nets {wdata[25]}]
#set_resistance 0.0557515  [get_nets {wdata[25]}]
#set_load 0.41978  [get_nets {wdata[24]}]
#set_resistance 0.0613445  [get_nets {wdata[24]}]
#set_load 0.532071  [get_nets {wdata[23]}]
#set_resistance 0.0775152  [get_nets {wdata[23]}]
#set_load 0.44416  [get_nets {wdata[22]}]
#set_resistance 0.0654244  [get_nets {wdata[22]}]
#set_load 0.498265  [get_nets {wdata[21]}]
#set_resistance 0.0735017  [get_nets {wdata[21]}]
#set_load 0.507407  [get_nets {wdata[20]}]
#set_resistance 0.0744076  [get_nets {wdata[20]}]
#set_load 0.621231  [get_nets {wdata[19]}]
#set_resistance 0.0902991  [get_nets {wdata[19]}]
#set_load 0.557491  [get_nets {wdata[18]}]
#set_resistance 0.081413  [get_nets {wdata[18]}]
#set_load 0.38016  [get_nets {wdata[17]}]
#set_resistance 0.0563316  [get_nets {wdata[17]}]
#set_load 0.314459  [get_nets {wdata[16]}]
#set_resistance 0.0464845  [get_nets {wdata[16]}]
#set_load 0.555881  [get_nets {wdata[15]}]
#set_resistance 0.0828183  [get_nets {wdata[15]}]
#set_load 0.490965  [get_nets {wdata[14]}]
#set_resistance 0.0726293  [get_nets {wdata[14]}]
#set_load 0.505557  [get_nets {wdata[13]}]
#set_resistance 0.0751545  [get_nets {wdata[13]}]
#set_load 1.21731  [get_nets {wdata[12]}]
#set_resistance 0.176391  [get_nets {wdata[12]}]
#set_load 1.52157  [get_nets {wdata[11]}]
#set_resistance 0.219142  [get_nets {wdata[11]}]
#set_load 0.629462  [get_nets {wdata[10]}]
#set_resistance 0.0911355  [get_nets {wdata[10]}]
#set_load 0.364294  [get_nets {wdata[9]}]
#set_resistance 0.0532187  [get_nets {wdata[9]}]
#set_load 0.399278  [get_nets {wdata[8]}]
#set_resistance 0.0580129  [get_nets {wdata[8]}]
#set_load 0.380167  [get_nets {wdata[7]}]
#set_resistance 0.0571413  [get_nets {wdata[7]}]
#set_load 0.328641  [get_nets {wdata[6]}]
#set_resistance 0.049471  [get_nets {wdata[6]}]
#set_load 0.293189  [get_nets {wdata[5]}]
#set_resistance 0.0440641  [get_nets {wdata[5]}]
#set_load 0.231598  [get_nets {wdata[4]}]
#set_resistance 0.0348493  [get_nets {wdata[4]}]
#set_load 0.31903  [get_nets {wdata[3]}]
#set_resistance 0.0474479  [get_nets {wdata[3]}]
#set_load 0.426633  [get_nets {wdata[2]}]
#set_resistance 0.0635992  [get_nets {wdata[2]}]
#set_load 1.64408  [get_nets {wdata[1]}]
#set_resistance 0.238483  [get_nets {wdata[1]}]
#set_load 0.388999  [get_nets {wdata[0]}]
#set_resistance 0.0564027  [get_nets {wdata[0]}]
#set_load 0.607376  [get_nets {rdata[31]}]
#set_resistance 0.0885347  [get_nets {rdata[31]}]
#set_load 0.385133  [get_nets {rdata[30]}]
#set_resistance 0.0580834  [get_nets {rdata[30]}]
#set_load 0.420854  [get_nets {rdata[29]}]
#set_resistance 0.0629168  [get_nets {rdata[29]}]
#set_load 0.373523  [get_nets {rdata[28]}]
#set_resistance 0.0556915  [get_nets {rdata[28]}]
#set_load 0.597367  [get_nets {rdata[27]}]
#set_resistance 0.0875831  [get_nets {rdata[27]}]
#set_load 0.357978  [get_nets {rdata[26]}]
#set_resistance 0.0539591  [get_nets {rdata[26]}]
#set_load 0.321245  [get_nets {rdata[25]}]
#set_resistance 0.0482401  [get_nets {rdata[25]}]
#set_load 0.47716  [get_nets {rdata[24]}]
#set_resistance 0.0704955  [get_nets {rdata[24]}]
#set_load 0.758998  [get_nets {rdata[23]}]
#set_resistance 0.11011  [get_nets {rdata[23]}]
#set_load 0.223761  [get_nets {rdata[22]}]
#set_resistance 0.0335573  [get_nets {rdata[22]}]
#set_load 0.466815  [get_nets {rdata[21]}]
#set_resistance 0.0675707  [get_nets {rdata[21]}]
#set_load 0.552969  [get_nets {rdata[20]}]
#set_resistance 0.0813652  [get_nets {rdata[20]}]
#set_load 0.889423  [get_nets {rdata[19]}]
#set_resistance 0.127299  [get_nets {rdata[19]}]
#set_load 0.592146  [get_nets {rdata[18]}]
#set_resistance 0.0849264  [get_nets {rdata[18]}]
#set_load 0.19175  [get_nets {rdata[17]}]
#set_resistance 0.0284154  [get_nets {rdata[17]}]
#set_load 0.231956  [get_nets {rdata[16]}]
#set_resistance 0.0339301  [get_nets {rdata[16]}]
#set_load 0.270652  [get_nets {rdata[15]}]
#set_resistance 0.0393428  [get_nets {rdata[15]}]
#set_load 0.357253  [get_nets {rdata[14]}]
#set_resistance 0.0514499  [get_nets {rdata[14]}]
#set_load 0.296326  [get_nets {rdata[13]}]
#set_resistance 0.0427139  [get_nets {rdata[13]}]
#set_load 0.437238  [get_nets {rdata[12]}]
#set_resistance 0.0625298  [get_nets {rdata[12]}]
#set_load 0.467298  [get_nets {rdata[11]}]
#set_resistance 0.06657  [get_nets {rdata[11]}]
#set_load 0.671618  [get_nets {rdata[10]}]
#set_resistance 0.0953641  [get_nets {rdata[10]}]
#set_load 0.856678  [get_nets {rdata[9]}]
#set_resistance 0.124289  [get_nets {rdata[9]}]
#set_load 0.998698  [get_nets {rdata[8]}]
#set_resistance 0.144205  [get_nets {rdata[8]}]
#set_load 1.04683  [get_nets {rdata[7]}]
#set_resistance 0.150895  [get_nets {rdata[7]}]
#set_load 1.1487  [get_nets {rdata[6]}]
#set_resistance 0.165325  [get_nets {rdata[6]}]
#set_load 1.21517  [get_nets {rdata[5]}]
#set_resistance 0.174478  [get_nets {rdata[5]}]
#set_load 1.33414  [get_nets {rdata[4]}]
#set_resistance 0.192046  [get_nets {rdata[4]}]
#set_load 1.13014  [get_nets {rdata[3]}]
#set_resistance 0.162251  [get_nets {rdata[3]}]
#set_load 1.24592  [get_nets {rdata[2]}]
#set_resistance 0.178528  [get_nets {rdata[2]}]
#set_load 1.07356  [get_nets {rdata[1]}]
#set_resistance 0.153368  [get_nets {rdata[1]}]
#set_load 1.06672  [get_nets {rdata[0]}]
#set_resistance 0.151853  [get_nets {rdata[0]}]
#set_load 0.420255  [get_nets u_tlul_adapter_sram_N210]
#set_resistance 0.0597864  [get_nets u_tlul_adapter_sram_N210]
#set_load 0.248692  [get_nets {u_tlul_adapter_sram_rdata_tlword[0]}]
#set_resistance 0.0358567  [get_nets {u_tlul_adapter_sram_rdata_tlword[0]}]
#set_load 0.370772  [get_nets {u_tlul_adapter_sram_rdata_tlword[1]}]
#set_resistance 0.0543742  [get_nets {u_tlul_adapter_sram_rdata_tlword[1]}]
#set_load 0.45549  [get_nets {u_tlul_adapter_sram_rdata_tlword[2]}]
#set_resistance 0.067052  [get_nets {u_tlul_adapter_sram_rdata_tlword[2]}]
#set_load 0.465045  [get_nets {u_tlul_adapter_sram_rdata_tlword[3]}]
#set_resistance 0.0680188  [get_nets {u_tlul_adapter_sram_rdata_tlword[3]}]
#set_load 0.468426  [get_nets {u_tlul_adapter_sram_rdata_tlword[4]}]
#set_resistance 0.0693102  [get_nets {u_tlul_adapter_sram_rdata_tlword[4]}]
#set_load 0.468605  [get_nets {u_tlul_adapter_sram_rdata_tlword[5]}]
#set_resistance 0.0696573  [get_nets {u_tlul_adapter_sram_rdata_tlword[5]}]
#set_load 0.390359  [get_nets {u_tlul_adapter_sram_rdata_tlword[6]}]
#set_resistance 0.058047  [get_nets {u_tlul_adapter_sram_rdata_tlword[6]}]
#set_load 0.490924  [get_nets {u_tlul_adapter_sram_rdata_tlword[7]}]
#set_resistance 0.073116  [get_nets {u_tlul_adapter_sram_rdata_tlword[7]}]
#set_load 0.233248  [get_nets {u_tlul_adapter_sram_rdata_tlword[8]}]
#set_resistance 0.0339546  [get_nets {u_tlul_adapter_sram_rdata_tlword[8]}]
#set_load 0.276754  [get_nets {u_tlul_adapter_sram_rdata_tlword[9]}]
#set_resistance 0.0401853  [get_nets {u_tlul_adapter_sram_rdata_tlword[9]}]
#set_load 0.308068  [get_nets {u_tlul_adapter_sram_rdata_tlword[10]}]
#set_resistance 0.0459807  [get_nets {u_tlul_adapter_sram_rdata_tlword[10]}]
#set_load 0.441143  [get_nets {u_tlul_adapter_sram_rdata_tlword[11]}]
#set_resistance 0.0648273  [get_nets {u_tlul_adapter_sram_rdata_tlword[11]}]
#set_load 0.480694  [get_nets {u_tlul_adapter_sram_rdata_tlword[12]}]
#set_resistance 0.0705439  [get_nets {u_tlul_adapter_sram_rdata_tlword[12]}]
#set_load 0.322613  [get_nets {u_tlul_adapter_sram_rdata_tlword[13]}]
#set_resistance 0.0488636  [get_nets {u_tlul_adapter_sram_rdata_tlword[13]}]
#set_load 0.567404  [get_nets {u_tlul_adapter_sram_rdata_tlword[14]}]
#set_resistance 0.0837839  [get_nets {u_tlul_adapter_sram_rdata_tlword[14]}]
#set_load 0.46306  [get_nets {u_tlul_adapter_sram_rdata_tlword[15]}]
#set_resistance 0.0690818  [get_nets {u_tlul_adapter_sram_rdata_tlword[15]}]
#set_load 0.453501  [get_nets {u_tlul_adapter_sram_rdata_tlword[16]}]
#set_resistance 0.0663373  [get_nets {u_tlul_adapter_sram_rdata_tlword[16]}]
#set_load 0.307754  [get_nets {u_tlul_adapter_sram_rdata_tlword[17]}]
#set_resistance 0.0452573  [get_nets {u_tlul_adapter_sram_rdata_tlword[17]}]
#set_load 0.339896  [get_nets {u_tlul_adapter_sram_rdata_tlword[18]}]
#set_resistance 0.0491797  [get_nets {u_tlul_adapter_sram_rdata_tlword[18]}]
#set_load 0.6634  [get_nets {u_tlul_adapter_sram_rdata_tlword[19]}]
#set_resistance 0.0996615  [get_nets {u_tlul_adapter_sram_rdata_tlword[19]}]
#set_load 0.353517  [get_nets {u_tlul_adapter_sram_rdata_tlword[20]}]
#set_resistance 0.0504441  [get_nets {u_tlul_adapter_sram_rdata_tlword[20]}]
#set_load 0.178694  [get_nets {u_tlul_adapter_sram_rdata_tlword[21]}]
#set_resistance 0.0265203  [get_nets {u_tlul_adapter_sram_rdata_tlword[21]}]
#set_load 0.268758  [get_nets {u_tlul_adapter_sram_rdata_tlword[22]}]
#set_resistance 0.0390627  [get_nets {u_tlul_adapter_sram_rdata_tlword[22]}]
#set_load 0.222415  [get_nets {u_tlul_adapter_sram_rdata_tlword[23]}]
#set_resistance 0.0333623  [get_nets {u_tlul_adapter_sram_rdata_tlword[23]}]
#set_load 0.359828  [get_nets {u_tlul_adapter_sram_rdata_tlword[24]}]
#set_resistance 0.0518627  [get_nets {u_tlul_adapter_sram_rdata_tlword[24]}]
#set_load 0.405403  [get_nets {u_tlul_adapter_sram_rdata_tlword[25]}]
#set_resistance 0.0592545  [get_nets {u_tlul_adapter_sram_rdata_tlword[25]}]
#set_load 0.343277  [get_nets {u_tlul_adapter_sram_rdata_tlword[26]}]
#set_resistance 0.0505415  [get_nets {u_tlul_adapter_sram_rdata_tlword[26]}]
#set_load 0.364356  [get_nets {u_tlul_adapter_sram_rdata_tlword[27]}]
#set_resistance 0.0543572  [get_nets {u_tlul_adapter_sram_rdata_tlword[27]}]
#set_load 0.504733  [get_nets {u_tlul_adapter_sram_rdata_tlword[28]}]
#set_resistance 0.0743932  [get_nets {u_tlul_adapter_sram_rdata_tlword[28]}]
#set_load 0.478245  [get_nets {u_tlul_adapter_sram_rdata_tlword[29]}]
#set_resistance 0.0708006  [get_nets {u_tlul_adapter_sram_rdata_tlword[29]}]
#set_load 0.421848  [get_nets {u_tlul_adapter_sram_rdata_tlword[30]}]
#set_resistance 0.0624645  [get_nets {u_tlul_adapter_sram_rdata_tlword[30]}]
#set_load 0.501932  [get_nets {u_tlul_adapter_sram_rdata_tlword[31]}]
#set_resistance 0.0728996  [get_nets {u_tlul_adapter_sram_rdata_tlword[31]}]
#set_load 0.529332  [get_nets u_tlul_adapter_sram_reqfifo_wdata_op__0_]
#set_resistance 0.0776882  [get_nets u_tlul_adapter_sram_reqfifo_wdata_op__0_]
#set_load 0.828202  [get_nets {tl_i[0]}]
#set_resistance 0.123085  [get_nets {tl_i[0]}]
#set_load 0.304353  [get_nets {tl_i[24]}]
#set_resistance 0.0437781  [get_nets {tl_i[24]}]
#set_load 1.65196  [get_nets {tl_i[25]}]
#set_resistance 0.23991  [get_nets {tl_i[25]}]
#set_load 0.471992  [get_nets {tl_i[26]}]
#set_resistance 0.0707199  [get_nets {tl_i[26]}]
#set_load 0.368715  [get_nets {tl_i[27]}]
#set_resistance 0.0552256  [get_nets {tl_i[27]}]
#set_load 0.282724  [get_nets {tl_i[28]}]
#set_resistance 0.042846  [get_nets {tl_i[28]}]
#set_load 0.331339  [get_nets {tl_i[29]}]
#set_resistance 0.0500899  [get_nets {tl_i[29]}]
#set_load 0.368233  [get_nets {tl_i[30]}]
#set_resistance 0.0557158  [get_nets {tl_i[30]}]
#set_load 0.4212  [get_nets {tl_i[31]}]
#set_resistance 0.0636051  [get_nets {tl_i[31]}]
#set_load 0.477799  [get_nets {tl_i[32]}]
#set_resistance 0.0701704  [get_nets {tl_i[32]}]
#set_load 0.444257  [get_nets {tl_i[33]}]
#set_resistance 0.0655951  [get_nets {tl_i[33]}]
#set_load 0.543374  [get_nets {tl_i[34]}]
#set_resistance 0.0782919  [get_nets {tl_i[34]}]
#set_load 1.43404  [get_nets {tl_i[35]}]
#set_resistance 0.206079  [get_nets {tl_i[35]}]
#set_load 1.12833  [get_nets {tl_i[36]}]
#set_resistance 0.163109  [get_nets {tl_i[36]}]
#set_load 0.553799  [get_nets {tl_i[37]}]
#set_resistance 0.0827132  [get_nets {tl_i[37]}]
#set_load 0.540649  [get_nets {tl_i[38]}]
#set_resistance 0.080407  [get_nets {tl_i[38]}]
#set_load 0.527707  [get_nets {tl_i[39]}]
#set_resistance 0.0787707  [get_nets {tl_i[39]}]
#set_load 0.243361  [get_nets {tl_i[40]}]
#set_resistance 0.0357634  [get_nets {tl_i[40]}]
#set_load 0.30762  [get_nets {tl_i[41]}]
#set_resistance 0.0453915  [get_nets {tl_i[41]}]
#set_load 0.595731  [get_nets {tl_i[42]}]
#set_resistance 0.0872985  [get_nets {tl_i[42]}]
#set_load 0.660913  [get_nets {tl_i[43]}]
#set_resistance 0.0964035  [get_nets {tl_i[43]}]
#set_load 0.557182  [get_nets {tl_i[44]}]
#set_resistance 0.082045  [get_nets {tl_i[44]}]
#set_load 0.432934  [get_nets {tl_i[45]}]
#set_resistance 0.0636566  [get_nets {tl_i[45]}]
#set_load 0.377387  [get_nets {tl_i[46]}]
#set_resistance 0.0553603  [get_nets {tl_i[46]}]
#set_load 0.586172  [get_nets {tl_i[47]}]
#set_resistance 0.0858095  [get_nets {tl_i[47]}]
#set_load 0.460904  [get_nets {tl_i[48]}]
#set_resistance 0.0676679  [get_nets {tl_i[48]}]
#set_load 0.313816  [get_nets {tl_i[49]}]
#set_resistance 0.0472203  [get_nets {tl_i[49]}]
#set_load 0.37076  [get_nets {tl_i[50]}]
#set_resistance 0.0548083  [get_nets {tl_i[50]}]
#set_load 0.28848  [get_nets {tl_i[51]}]
#set_resistance 0.0433874  [get_nets {tl_i[51]}]
#set_load 0.262684  [get_nets {tl_i[52]}]
#set_resistance 0.0396049  [get_nets {tl_i[52]}]
#set_load 0.301667  [get_nets {tl_i[53]}]
#set_resistance 0.0448021  [get_nets {tl_i[53]}]
#set_load 0.232037  [get_nets {tl_i[54]}]
#set_resistance 0.0347871  [get_nets {tl_i[54]}]
#set_load 0.320069  [get_nets {tl_i[55]}]
#set_resistance 0.0477116  [get_nets {tl_i[55]}]
#set_load 1.67766  [get_nets {tl_i[56]}]
#set_resistance 0.183995  [get_nets {tl_i[56]}]
#set_load 1.57737  [get_nets {tl_i[57]}]
#set_resistance 0.172749  [get_nets {tl_i[57]}]
#set_load 2.29312  [get_nets {tl_i[58]}]
#set_resistance 0.270808  [get_nets {tl_i[58]}]
#set_load 1.31208  [get_nets {tl_i[59]}]
#set_resistance 0.164783  [get_nets {tl_i[59]}]
#set_load 0.210027  [get_nets {tl_i[62]}]
#set_resistance 0.0317643  [get_nets {tl_i[62]}]
#set_load 0.133011  [get_nets {tl_i[63]}]
#set_resistance 0.0197499  [get_nets {tl_i[63]}]
#set_load 0.22925  [get_nets {tl_i[64]}]
#set_resistance 0.0341736  [get_nets {tl_i[64]}]
#set_load 0.234732  [get_nets {tl_i[65]}]
#set_resistance 0.0345846  [get_nets {tl_i[65]}]
#set_load 0.174498  [get_nets {tl_i[66]}]
#set_resistance 0.0264156  [get_nets {tl_i[66]}]
#set_load 0.207412  [get_nets {tl_i[67]}]
#set_resistance 0.0302892  [get_nets {tl_i[67]}]
#set_load 0.122716  [get_nets {tl_i[68]}]
#set_resistance 0.0184681  [get_nets {tl_i[68]}]
#set_load 0.0915281  [get_nets {tl_i[69]}]
#set_resistance 0.0136357  [get_nets {tl_i[69]}]
#set_load 0.262517  [get_nets {tl_i[70]}]
#set_resistance 0.0379964  [get_nets {tl_i[70]}]
#set_load 0.185315  [get_nets {tl_i[71]}]
#set_resistance 0.0271427  [get_nets {tl_i[71]}]
#set_load 0.296791  [get_nets {tl_i[72]}]
#set_resistance 0.0447875  [get_nets {tl_i[72]}]
#set_load 0.0435024  [get_nets {tl_i[92]}]
#set_resistance 0.00650642  [get_nets {tl_i[92]}]
#set_load 0.0544131  [get_nets {tl_i[93]}]
#set_resistance 0.00804375  [get_nets {tl_i[93]}]
#set_load 0.178115  [get_nets {tl_i[94]}]
#set_resistance 0.0268927  [get_nets {tl_i[94]}]
#set_load 0.245138  [get_nets {tl_i[95]}]
#set_resistance 0.0363362  [get_nets {tl_i[95]}]
#set_load 0.236944  [get_nets {tl_i[96]}]
#set_resistance 0.0351773  [get_nets {tl_i[96]}]
#set_load 0.203173  [get_nets {tl_i[97]}]
#set_resistance 0.0304189  [get_nets {tl_i[97]}]
#set_load 0.0750264  [get_nets {tl_i[98]}]
#set_resistance 0.0109359  [get_nets {tl_i[98]}]
#set_load 0.039177  [get_nets {tl_i[99]}]
#set_resistance 0.00588467  [get_nets {tl_i[99]}]
#set_load 0.933345  [get_nets {tl_i[100]}]
#set_resistance 0.110692  [get_nets {tl_i[100]}]
#set_load 1.12353  [get_nets {tl_i[101]}]
#set_resistance 0.132243  [get_nets {tl_i[101]}]
#set_load 0.429019  [get_nets {tl_i[105]}]
#set_resistance 0.0590525  [get_nets {tl_i[105]}]
#set_load 0.497436  [get_nets {tl_i[106]}]
#set_resistance 0.0684343  [get_nets {tl_i[106]}]
#set_load 0.54916  [get_nets {tl_i[107]}]
#set_resistance 0.070419  [get_nets {tl_i[107]}]
#set_load 0.644203  [get_nets {tl_i[108]}]
#set_resistance 0.0932684  [get_nets {tl_i[108]}]
#set_load 0.727063  [get_nets {tl_i[15]}]
#set_resistance 0.0992766  [get_nets {tl_i[15]}]
#set_load 0.356928  [get_nets {tl_i[16]}]
#set_resistance 0.0529619  [get_nets {tl_i[16]}]
#set_load 0.684516  [get_nets {tl_i[17]}]
#set_resistance 0.0928574  [get_nets {tl_i[17]}]
#set_load 0.615257  [get_nets {tl_i[18]}]
#set_resistance 0.0839643  [get_nets {tl_i[18]}]
#set_load 0.152497  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[0]}]
#set_resistance 0.0220609  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[0]}]
#set_load 0.0602536  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[1]}]
#set_resistance 0.00882622  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[1]}]
#set_load 0.311115  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[2]}]
#set_resistance 0.0444247  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[2]}]
#set_load 0.0889147  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[3]}]
#set_resistance 0.0131346  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[3]}]
#set_load 0.298296  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[4]}]
#set_resistance 0.0428595  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[4]}]
#set_load 0.0926983  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[5]}]
#set_resistance 0.0138239  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[5]}]
#set_load 0.295681  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[6]}]
#set_resistance 0.0424875  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[6]}]
#set_load 0.0694319  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[7]}]
#set_resistance 0.0105302  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[7]}]
#set_load 0.0392065  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[8]}]
#set_resistance 0.00566187  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[8]}]
#set_load 0.498766  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[9]}]
#set_resistance 0.0737508  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[9]}]
#set_load 0.124373  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[10]}]
#set_resistance 0.0182424  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[10]}]
#set_load 0.363984  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[11]}]
#set_resistance 0.0518617  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[11]}]
#set_load 0.120928  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[12]}]
#set_resistance 0.0175256  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[12]}]
#set_load 0.425811  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[13]}]
#set_resistance 0.0601214  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[13]}]
#set_load 0.39628  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[14]}]
#set_resistance 0.0565182  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[14]}]
#set_load 0.440723  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[15]}]
#set_resistance 0.0622142  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[15]}]
#set_load 0.0292342  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[16]}]
#set_resistance 0.00423522  [get_nets {u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_storage_rdata[16]}]
#set_load 0.293054  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_rptr_value_0_]
#set_resistance 0.0421741  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_rptr_value_0_]
#set_load 0.401463  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_wptr_value_0_]
#set_resistance 0.0574086  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_wptr_value_0_]
#set_load 0.337924  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_fifo_rptr_1_]
#set_resistance 0.0447467  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_fifo_rptr_1_]
#set_load 0.226616  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_fifo_wptr_1_]
#set_resistance 0.0308978  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_fifo_wptr_1_]
#set_load 0.272297  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_under_rst]
#set_resistance 0.0398269  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_under_rst]
#set_load 0.897311  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[1]}]
#set_resistance 0.126761  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[1]}]
#set_load 1.18872  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[2]}]
#set_resistance 0.167571  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[2]}]
#set_load 0.250645  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[3]}]
#set_resistance 0.0355504  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[3]}]
#set_load 1.09379  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[4]}]
#set_resistance 0.154938  [get_nets {u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_storage_rdata[4]}]
#set_load 0.366327  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_rptr_value_0_]
#set_resistance 0.0530771  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_rptr_value_0_]
#set_load 0.329864  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_wptr_value_0_]
#set_resistance 0.0478348  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_wptr_value_0_]
#set_load 0.455284  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_fifo_rptr_1_]
#set_resistance 0.064663  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_fifo_rptr_1_]
#set_load 0.147273  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_fifo_wptr_1_]
#set_resistance 0.021933  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_fifo_wptr_1_]
#set_load 0.429956  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_under_rst]
#set_resistance 0.0636816  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_under_rst]
#set_load 0.282001  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[0]}]
#set_resistance 0.0371579  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[0]}]
#set_load 0.212392  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[1]}]
#set_resistance 0.0317359  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[1]}]
#set_load 0.2175  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[2]}]
#set_resistance 0.0312765  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[2]}]
#set_load 0.0638816  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[3]}]
#set_resistance 0.00927407  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[3]}]
#set_load 0.150622  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[4]}]
#set_resistance 0.0219335  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[4]}]
#set_load 0.0619451  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[5]}]
#set_resistance 0.00897614  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[5]}]
#set_load 0.146867  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[6]}]
#set_resistance 0.0212033  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[6]}]
#set_load 0.127037  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[7]}]
#set_resistance 0.0184093  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[7]}]
#set_load 0.321683  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[8]}]
#set_resistance 0.0460364  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[8]}]
#set_load 0.139397  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[9]}]
#set_resistance 0.0204649  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[9]}]
#set_load 0.379348  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[10]}]
#set_resistance 0.0540801  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[10]}]
#set_load 0.075784  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[11]}]
#set_resistance 0.0107229  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[11]}]
#set_load 0.346349  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[12]}]
#set_resistance 0.0493787  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[12]}]
#set_load 0.0603684  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[13]}]
#set_resistance 0.00914366  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[13]}]
#set_load 0.218191  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[14]}]
#set_resistance 0.0313858  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[14]}]
#set_load 0.139761  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[15]}]
#set_resistance 0.0204199  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[15]}]
#set_load 0.172435  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[16]}]
#set_resistance 0.0249435  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[16]}]
#set_load 0.0652837  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[17]}]
#set_resistance 0.00929923  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[17]}]
#set_load 0.266909  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[18]}]
#set_resistance 0.0383311  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[18]}]
#set_load 0.170733  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[19]}]
#set_resistance 0.0247759  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[19]}]
#set_load 0.0390499  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[20]}]
#set_resistance 0.00572557  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[20]}]
#set_load 0.148787  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[21]}]
#set_resistance 0.0215011  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[21]}]
#set_load 0.0400062  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[22]}]
#set_resistance 0.00600061  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[22]}]
#set_load 0.0530576  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[23]}]
#set_resistance 0.00804231  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[23]}]
#set_load 0.165163  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[24]}]
#set_resistance 0.0237602  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[24]}]
#set_load 0.1776  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[25]}]
#set_resistance 0.0256343  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[25]}]
#set_load 0.174484  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[26]}]
#set_resistance 0.0254943  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[26]}]
#set_load 0.20579  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[27]}]
#set_resistance 0.0296293  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[27]}]
#set_load 0.135087  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[28]}]
#set_resistance 0.0196672  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[28]}]
#set_load 0.210644  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[29]}]
#set_resistance 0.0303536  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[29]}]
#set_load 0.0767995  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[30]}]
#set_resistance 0.0114852  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[30]}]
#set_load 0.281899  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[31]}]
#set_resistance 0.0403891  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[31]}]
#set_load 0.129522  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[32]}]
#set_resistance 0.0190211  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[32]}]
#set_load 0.273472  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[33]}]
#set_resistance 0.0393169  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[33]}]
#set_load 0.100159  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[34]}]
#set_resistance 0.0147911  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[34]}]
#set_load 0.282535  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[35]}]
#set_resistance 0.0405978  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[35]}]
#set_load 0.209649  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[36]}]
#set_resistance 0.0318209  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[36]}]
#set_load 0.384175  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[37]}]
#set_resistance 0.0557313  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[37]}]
#set_load 0.137578  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[38]}]
#set_resistance 0.0202908  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[38]}]
#set_load 0.0830787  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[39]}]
#set_resistance 0.0118417  [get_nets {u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_storage_rdata[39]}]
#set_load 0.186877  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_rptr_value_0_]
#set_resistance 0.0271218  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_rptr_value_0_]
#set_load 0.429813  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_wptr_value_0_]
#set_resistance 0.06151  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_wptr_value_0_]
#set_load 0.277963  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_fifo_rptr_1_]
#set_resistance 0.0399278  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_fifo_rptr_1_]
#set_load 0.500396  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_fifo_wptr_1_]
#set_resistance 0.0667299  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_fifo_wptr_1_]
#set_load 0.2852  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_under_rst]
#set_resistance 0.0427009  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_under_rst]
#set_load 0.0596139  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_resistance 0.00901052  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_load 0.339262  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_resistance 0.0464549  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_load 0.0569402  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_resistance 0.00860301  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_load 1.42999  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_resistance 0.174202  [get_nets u_tlul_adapter_sram_u_rspfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_load 0.122163  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_resistance 0.0179899  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_load 0.353143  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_resistance 0.046612  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_load 0.388414  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_resistance 0.0552203  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_load 3.174  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_resistance 0.343669  [get_nets u_tlul_adapter_sram_u_sramreqfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_load 0.0726597  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_resistance 0.0104537  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N25]
#set_load 0.340321  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_resistance 0.0447939  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N23]
#set_load 0.354669  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_resistance 0.0507085  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N11]
#set_load 1.36859  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_resistance 0.168608  [get_nets u_tlul_adapter_sram_u_reqfifo_gen_normal_fifo_u_fifo_cnt_N9]
#set_load 0.115345  [get_nets n126]
#set_resistance 0.0167856  [get_nets n126]
#set_load 0.180717  [get_nets n131]
#set_resistance 0.0261088  [get_nets n131]
#set_load 0.0821743  [get_nets n170]
#set_resistance 0.0123942  [get_nets n170]
#set_load 0.0894163  [get_nets n175]
#set_resistance 0.0133192  [get_nets n175]
#set_load 0.0369505  [get_nets n188]
#set_resistance 0.00528595  [get_nets n188]
#set_load 0.241884  [get_nets n189]
#set_resistance 0.0343063  [get_nets n189]
#set_load 0.0810657  [get_nets n192]
#set_resistance 0.0122064  [get_nets n192]
#set_load 0.12204  [get_nets n197]
#set_resistance 0.0177663  [get_nets n197]
#set_load 0.197854  [get_nets n211]
#set_resistance 0.0279965  [get_nets n211]
#set_load 2.60677  [get_nets n322]
#set_resistance 0.272085  [get_nets n322]
#set_load 2.54795  [get_nets n323]
#set_resistance 0.26625  [get_nets n323]
#set_load 1.27094  [get_nets n324]
#set_resistance 0.135927  [get_nets n324]
#set_load 1.41436  [get_nets n325]
#set_resistance 0.15076  [get_nets n325]
#set_load 0.0898774  [get_nets n326]
#set_resistance 0.0131163  [get_nets n326]
#set_load 0.26697  [get_nets n327]
#set_resistance 0.0396046  [get_nets n327]
#set_load 1.2674  [get_nets n328]
#set_resistance 0.112278  [get_nets n328]
#set_load 0.0704066  [get_nets n329]
#set_resistance 0.0105413  [get_nets n329]
#set_load 0.0422741  [get_nets n330]
#set_resistance 0.00638833  [get_nets n330]
#set_load 0.0900406  [get_nets n331]
#set_resistance 0.0127769  [get_nets n331]
#set_load 0.0349717  [get_nets n332]
#set_resistance 0.0049702  [get_nets n332]
#set_load 0.206742  [get_nets n333]
#set_resistance 0.0299864  [get_nets n333]
#set_load 0.0743208  [get_nets n334]
#set_resistance 0.0111491  [get_nets n334]
#set_load 0.107342  [get_nets n335]
#set_resistance 0.0151407  [get_nets n335]
#set_load 0.33555  [get_nets n336]
#set_resistance 0.0492794  [get_nets n336]
#set_load 0.177537  [get_nets n337]
#set_resistance 0.0262853  [get_nets n337]
#set_load 0.349273  [get_nets n338]
#set_resistance 0.0523046  [get_nets n338]
#set_load 0.121892  [get_nets n339]
#set_resistance 0.0182759  [get_nets n339]
#set_load 0.108614  [get_nets n340]
#set_resistance 0.0164442  [get_nets n340]
#set_load 0.0707788  [get_nets n341]
#set_resistance 0.0105375  [get_nets n341]
#set_load 0.04691  [get_nets n342]
#set_resistance 0.0070235  [get_nets n342]
#set_load 0.177776  [get_nets n343]
#set_resistance 0.024107  [get_nets n343]
#set_load 0.0525431  [get_nets n344]
#set_resistance 0.00789286  [get_nets n344]
#set_load 0.145288  [get_nets n345]
#set_resistance 0.0208428  [get_nets n345]
#set_load 0.206243  [get_nets n346]
#set_resistance 0.0279802  [get_nets n346]
#set_load 0.352872  [get_nets n347]
#set_resistance 0.0468336  [get_nets n347]
#set_load 0.127652  [get_nets n348]
#set_resistance 0.0187998  [get_nets n348]
#set_load 0.0493351  [get_nets n349]
#set_resistance 0.00695443  [get_nets n349]
#set_load 0.160759  [get_nets n350]
#set_resistance 0.0229092  [get_nets n350]
#set_load 0.100363  [get_nets n351]
#set_resistance 0.0148391  [get_nets n351]
#set_load 0.0789183  [get_nets n352]
#set_resistance 0.0116492  [get_nets n352]
#set_load 0.0623319  [get_nets n353]
#set_resistance 0.00884328  [get_nets n353]
#set_load 0.113275  [get_nets n354]
#set_resistance 0.0168977  [get_nets n354]
#set_load 0.0791491  [get_nets n355]
#set_resistance 0.0111693  [get_nets n355]
#set_load 0.112339  [get_nets n356]
#set_resistance 0.0158717  [get_nets n356]
#set_load 0.246736  [get_nets n357]
#set_resistance 0.0368494  [get_nets n357]
#set_load 0.347157  [get_nets n358]
#set_resistance 0.0503805  [get_nets n358]
#set_load 0.556064  [get_nets n359]
#set_resistance 0.0809829  [get_nets n359]
#set_load 0.258829  [get_nets n360]
#set_resistance 0.0377595  [get_nets n360]
#set_load 0.530062  [get_nets n361]
#set_resistance 0.0760375  [get_nets n361]
#set_load 0.550132  [get_nets n362]
#set_resistance 0.078387  [get_nets n362]
#set_load 0.0604159  [get_nets n363]
#set_resistance 0.00855133  [get_nets n363]
#set_load 0.217551  [get_nets n364]
#set_resistance 0.032104  [get_nets n364]
#set_load 0.270822  [get_nets n365]
#set_resistance 0.0401416  [get_nets n365]
#set_load 0.0601121  [get_nets n366]
#set_resistance 0.00860837  [get_nets n366]
#set_load 0.315244  [get_nets n367]
#set_resistance 0.0459841  [get_nets n367]
#set_load 0.156625  [get_nets n368]
#set_resistance 0.0233739  [get_nets n368]
#set_load 0.372775  [get_nets n369]
#set_resistance 0.0494203  [get_nets n369]
#set_load 0.0748446  [get_nets n370]
#set_resistance 0.0106415  [get_nets n370]
#set_load 0.551267  [get_nets n371]
#set_resistance 0.0713383  [get_nets n371]
#set_load 0.128554  [get_nets n372]
#set_resistance 0.0181652  [get_nets n372]
#set_load 0.0713367  [get_nets n373]
#set_resistance 0.0101943  [get_nets n373]
#set_load 0.368454  [get_nets n374]
#set_resistance 0.0493225  [get_nets n374]
#set_load 0.317463  [get_nets n375]
#set_resistance 0.046266  [get_nets n375]
#set_load 3.40391  [get_nets n376]
#set_resistance 0.316443  [get_nets n376]
#set_load 0.16391  [get_nets n377]
#set_resistance 0.0243871  [get_nets n377]
#set_load 0.889647  [get_nets n378]
#set_resistance 0.133402  [get_nets n378]
#set_load 0.754272  [get_nets n379]
#set_resistance 0.101213  [get_nets n379]
#set_load 1.21122  [get_nets n380]
#set_resistance 0.156385  [get_nets n380]
#set_load 0.567731  [get_nets n381]
#set_resistance 0.0806585  [get_nets n381]
#set_load 0.865464  [get_nets n382]
#set_resistance 0.111083  [get_nets n382]
#set_load 0.43905  [get_nets n383]
#set_resistance 0.0619588  [get_nets n383]
#set_load 0.279208  [get_nets n384]
#set_resistance 0.0394593  [get_nets n384]
#set_load 1.57393  [get_nets n385]
#set_resistance 0.19424  [get_nets n385]
#set_load 0.921842  [get_nets n386]
#set_resistance 0.105693  [get_nets n386]
#set_load 0.776918  [get_nets n387]
#set_resistance 0.116854  [get_nets n387]
#set_load 0.168091  [get_nets n388]
#set_resistance 0.0244155  [get_nets n388]
#set_load 1.07042  [get_nets n389]
#set_resistance 0.152336  [get_nets n389]
#set_load 0.0446076  [get_nets n390]
#set_resistance 0.0064009  [get_nets n390]
#set_load 0.0861603  [get_nets n391]
#set_resistance 0.0122632  [get_nets n391]
#set_load 0.0509191  [get_nets n392]
#set_resistance 0.00729152  [get_nets n392]
#set_load 0.160529  [get_nets n393]
#set_resistance 0.0235299  [get_nets n393]
#set_load 0.0401542  [get_nets n394]
#set_resistance 0.00568458  [get_nets n394]
#set_load 0.120867  [get_nets n395]
#set_resistance 0.0171322  [get_nets n395]
#set_load 0.0568994  [get_nets n396]
#set_resistance 0.00810995  [get_nets n396]
#set_load 1.23039  [get_nets n397]
#set_resistance 0.125321  [get_nets n397]
#set_load 0.0472204  [get_nets n401]
#set_resistance 0.00672594  [get_nets n401]
#set_load 0.183448  [get_nets n402]
#set_resistance 0.0259768  [get_nets n402]
#set_load 0.0645868  [get_nets n403]
#set_resistance 0.00924854  [get_nets n403]
#set_load 0.0925661  [get_nets n404]
#set_resistance 0.0132071  [get_nets n404]
#set_load 0.261416  [get_nets n405]
#set_resistance 0.0390524  [get_nets n405]
#set_load 0.381198  [get_nets n409]
#set_resistance 0.0570882  [get_nets n409]
#set_load 0.160609  [get_nets n410]
#set_resistance 0.0241288  [get_nets n410]
#set_load 0.322354  [get_nets n411]
#set_resistance 0.0466913  [get_nets n411]
#set_load 0.165597  [get_nets n412]
#set_resistance 0.0249595  [get_nets n412]
#set_load 0.141573  [get_nets n413]
#set_resistance 0.0200541  [get_nets n413]
#set_load 0.322421  [get_nets n414]
#set_resistance 0.0467738  [get_nets n414]
#set_load 0.172265  [get_nets n415]
#set_resistance 0.0259048  [get_nets n415]
#set_load 0.60805  [get_nets n416]
#set_resistance 0.0621929  [get_nets n416]
#set_load 0.0980561  [get_nets n417]
#set_resistance 0.0142634  [get_nets n417]
#set_load 1.47931  [get_nets n418]
#set_resistance 0.179906  [get_nets n418]
#set_load 0.408019  [get_nets n419]
#set_resistance 0.0610816  [get_nets n419]
#set_load 0.390613  [get_nets n420]
#set_resistance 0.058242  [get_nets n420]
#set_load 0.150422  [get_nets n421]
#set_resistance 0.0227479  [get_nets n421]
#set_load 0.181567  [get_nets n424]
#set_resistance 0.0271108  [get_nets n424]
#set_load 0.151105  [get_nets n426]
#set_resistance 0.0229159  [get_nets n426]
#set_load 0.131642  [get_nets n427]
#set_resistance 0.0187099  [get_nets n427]
#set_load 0.179152  [get_nets n428]
#set_resistance 0.0261649  [get_nets n428]
#set_load 0.889537  [get_nets n429]
#set_resistance 0.0897322  [get_nets n429]
#set_load 0.177569  [get_nets n430]
#set_resistance 0.0261446  [get_nets n430]
#set_load 0.294517  [get_nets n431]
#set_resistance 0.0417126  [get_nets n431]
#set_load 0.349956  [get_nets n432]
#set_resistance 0.0524197  [get_nets n432]
#set_load 0.3486  [get_nets n433]
#set_resistance 0.0522247  [get_nets n433]
#set_load 1.72664  [get_nets n434]
#set_resistance 0.179655  [get_nets n434]
#set_load 0.0853387  [get_nets n438]
#set_resistance 0.0121531  [get_nets n438]
#set_load 0.229514  [get_nets n439]
#set_resistance 0.0335473  [get_nets n439]
#set_load 3.67187  [get_nets n467]
#set_resistance 0.304747  [get_nets n467]
#set_load 3.71286  [get_nets n468]
#set_resistance 0.309167  [get_nets n468]
#set_load 3.36057  [get_nets n469]
#set_resistance 0.27942  [get_nets n469]
#set_load 3.69766  [get_nets n471]
#set_resistance 0.306803  [get_nets n471]
#set_load 3.04216  [get_nets n472]
#set_resistance 0.253414  [get_nets n472]
#set_load 3.49132  [get_nets n473]
#set_resistance 0.290655  [get_nets n473]
#set_load 0.0283623  [get_nets {tl_o[9]}]
#set_resistance 0.00425399  [get_nets {tl_o[9]}]
#set_load 0.0610045  [get_nets {tl_o[10]}]
#set_resistance 0.00885373  [get_nets {tl_o[10]}]
#set_load 0.115831  [get_nets {tl_o[11]}]
#set_resistance 0.0175627  [get_nets {tl_o[11]}]
#set_load 0.0339876  [get_nets {tl_o[12]}]
#set_resistance 0.00504703  [get_nets {tl_o[12]}]
#set_load 0.0574141  [get_nets {tl_o[13]}]
#set_resistance 0.00834741  [get_nets {tl_o[13]}]
#set_load 0.0275364  [get_nets {tl_o[14]}]
#set_resistance 0.00413806  [get_nets {tl_o[14]}]
#set_load 0.0468772  [get_nets {tl_o[15]}]
#set_resistance 0.00693531  [get_nets {tl_o[15]}]
#set_load 0.234903  [get_nets {tl_o[48]}]
#set_resistance 0.0344799  [get_nets {tl_o[48]}]
#set_load 0.102486  [get_nets {tl_o[59]}]
#set_resistance 0.014698  [get_nets {tl_o[59]}]
#set_load 0.0944394  [get_nets {tl_o[60]}]
#set_resistance 0.0139447  [get_nets {tl_o[60]}]
#set_load 0.0276262  [get_nets {tl_o[61]}]
#set_resistance 0.00415028  [get_nets {tl_o[61]}]
#set_load 0.0877216  [get_nets {tl_o[63]}]
#set_resistance 0.0126177  [get_nets {tl_o[63]}]
#set_load 0.137772  [get_nets {tl_o[64]}]
#set_resistance 0.0196699  [get_nets {tl_o[64]}]
